# 16.05.24

symbols_mapping = {
    '→': '-', '←': '-', '↑': '^', '↓': 'v',
    '↔': '<->', '↕': '||', '⇄': '<=>', '⇅': '||',
    '°': 'deg', '±': '+/-', 'µ': 'u', '×': 'x', '÷': '/',
    '≤': '<=', '≥': '>=', '≠': '!=', '≈': '~=', '∑': 'sum', '∏': 'prod',
    '√': 'sqrt', '∞': 'inf', '∫': 'int', '∇': 'grad', '∂': 'd', '∴': 'therefore', '∵': 'because',
    '¬': 'not', '∧': 'and', '∨': 'or', '⊕': 'xor', '⊗': 'times',
    'α': 'alpha', 'β': 'beta', 'γ': 'gamma', 'δ': 'delta', 'ε': 'epsilon', 'ζ': 'zeta', 'η': 'eta', 'θ': 'theta', 'ι': 'iota', 'κ': 'kappa', 'λ': 'lambda', 'μ': 'mu', 'ν': 'nu', 'ξ': 'xi', 'ο': 'omicron', 'π': 'pi', 'ρ': 'rho', 'σ': 'sigma', 'τ': 'tau', 'υ': 'upsilon', 'φ': 'phi', 'χ': 'chi', 'ψ': 'psi', 'ω': 'omega'
}